In [1]:
import pandas
import numpy
import matplotlib

In [6]:
df = pandas.DataFrame({'population': [20000, 40000, 53344, 32903],
                      'GDP': [20.443, 34.222, 12.445, 89.655],
                      'continent': ['africa', 'europe', 'asia', 'america']
                      }, columns=['population', 'GDP', 'continent'])

In [7]:
df

   population     GDP continent
0       20000  20.443    africa
1       40000  34.222    europe
2       53344  12.445      asia
3       32903  89.655   america

In [8]:
df.index= ['Nigeria', 'england', 'china', 'new york']

In [9]:
df

          population     GDP continent
Nigeria        20000  20.443    africa
england        40000  34.222    europe
china          53344  12.445      asia
new york       32903  89.655   america

In [10]:
df.columns

Index(['population', 'GDP', 'continent'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Nigeria to new york
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  4 non-null      int64
 1   GDP         4 non-null      float64
 2   continent   4 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [12]:
df.shape

(4, 3)

In [13]:
df.describe()

         population        GDP
count      4.000000   4.000000
mean   36561.750000  39.191250
std    13918.135564  34.824045
min    20000.000000  12.445000
25%    29677.250000  18.443500
50%    36451.500000  27.332500
75%    43336.000000  48.080250
max    53344.000000  89.655000

In [17]:
df.dtypes

population      int64
GDP           float64
continent      object
dtype: object

In [21]:
df.loc['china']

population     53344
GDP           12.445
continent       asia
Name: china, dtype: object

In [22]:
df.loc['china', 'population']

53344

In [23]:
df.loc['Nigeria':'china', 'population']

Nigeria    20000
england    40000
china      53344
Name: population, dtype: int64

In [24]:
df.iloc[[1]]

         population     GDP continent
england       40000  34.222    europe

## use loc and iloc for rows while nothing for columns

In [25]:
df['population'] > 10000

Nigeria     True
england     True
china       True
new york    True
Name: population, dtype: bool

In [26]:
df.loc[df['population'] > 10000, ['population'] ]

          population
Nigeria        20000
england        40000
china          53344
new york       32903

In [35]:
crisis= pandas.Series([-10000, -10], index= ['population', 'GDP'])
crisis

population   -10000
GDP             -10
dtype: int64

In [36]:
df[['population', 'GDP']] + crisis

          population     GDP
Nigeria        10000  10.443
england        30000  24.222
china          43344   2.445
new york       22903  79.655

In [38]:
df.drop('new york')

         population     GDP continent
Nigeria       20000  20.443    africa
england       40000  34.222    europe
china         53344  12.445      asia

In [39]:
df

          population     GDP continent
Nigeria        20000  20.443    africa
england        40000  34.222    europe
china          53344  12.445      asia
new york       32903  89.655   america

In [45]:
foodintake= pandas.Series([1, 3, 3, 4], index=['Nigeria', 'england', 'china', 'new york'])

In [46]:
df['Food Intake'] = foodintake

In [47]:
df

          population     GDP continent  Food Intake
Nigeria        20000  20.443    africa            1
england        40000  34.222    europe            3
china          53344  12.445      asia            3
new york       32903  89.655   america            4